In [1]:
import pandas as pd

In [15]:
# load collar file
collar_df = pd.read_csv("../dataset/collar_all.csv", delimiter=";", encoding="utf-8")
collar_df = collar_df.replace(["#DIV/0!", "#N/A"], pd.NA)
collar_df.head()

,hole_id,date,easting_x,northing_y,elevation,elev_topo,eoh,is_old,is_twin,inc_samp
0,E07-017,44545,404120.680,114875.100,375.571,392.126007,16.0,1,0,18
1,E07-018,44394,404127.929,114849.522,383.153,397.937988,30.0,1,0,34
2,E07-019,44545,404157.778,114865.303,371.663,392.009003,16.0,1,0,16
3,E07-020,44394,404170.353,114853.791,371.346,393.838013,10.5,1,0,15
4,E07-021,44545,404208.368,114873.263,376.459,391.062988,19.5,1,0,21

In [16]:
# load assay file
assay_df = pd.read_csv("../dataset/intervall_all.csv", delimiter=";", encoding="utf-8")
assay_df = assay_df.replace(["#DIV/0!", "#N/A"], pd.NA)
assay_df.head()

,sample_id,hole_id,depth_from,depth_to,core_length,cr_%,is_old,is_twin,ni,fe,mgo,sio2,sm,co,cao,al2o3,lith
0,B1/E07-017/JAS/01,E07-017,0.0,1.0,1.0,1,1,0,1.14,38.67,2.32,24.15,10.409483,0.02,0.07,11.94,LIM
1,B1/E07-017/JAS/02,E07-017,1.0,1.5,0.5,1,1,0,2.08,12.78,20.00,38.10,1.905000,0.04,0.12,2.36,SAP
2,B1/E07-017/JAS/03,E07-017,1.5,2.0,0.5,1,1,0,1.92,10.29,23.33,38.80,1.663095,0.02,0.12,1.55,SAP
3,B1/E07-017/JAS/04,E07-017,2.0,3.0,1.0,1,1,0,2.02,8.33,25.16,39.49,1.569555,0.01,0.14,0.97,SAP
4,B1/E07-017/JAS/05,E07-017,3.0,3.4,0.4,1,1,0,2.13,7.18,26.80,39.61,1.477985,0.01,0.13,0.92,RSAP

In [14]:
from sqlalchemy import create_engine, text

# Replace with your PostgreSQL credentials
username = "adyatmaardi"
password = "541997"
host = "localhost"
port = "5432"
database = "NickelExploration_JAS"

# SQLAlchemy connection string
engine = create_engine(f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}")

# Test connection
try:
    with engine.connect() as connection:
        result = connection.execute(text("SELECT version();"))
        db_version = result.fetchone()
        print("✅ Connection successful!")
        print("PostgreSQL version:", db_version[0])
except Exception as e:
    print("❌ Connection failed!")
    print(e)

✅ Connection successful!
PostgreSQL version: PostgreSQL 15.13 (Debian 15.13-0+deb12u1) on x86_64-pc-linux-gnu, compiled by gcc (Debian 12.2.0-14+deb12u1) 12.2.0, 64-bit

In [19]:
# Send DataFrame to PostgreSQL
# Write collar table
collar_df.to_sql("collar", engine, schema="exploration", if_exists="replace", index=False)

# Write interval table
assay_df.to_sql("assay", engine, schema="exploration", if_exists="replace", index=False)

print("CSV successfully imported into PostgreSQL!")

CSV successfully imported into PostgreSQL!